#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	Версия 			= "1.1";
	Представление 	= "Выпуск продукции по оборудованию под заказ (МО)";
	Информация 		= "Выпуск продукции по оборудованию под заказ (МО)";
	Идентификатор 	= "мо_ВыпускПродукцииПоОборудованиюПодЗаказ";
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(СтандартныеПодсистемыСервер.ВерсияБиблиотеки());

	ПараметрыРегистрации.Вид 			 = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 		 = Версия;
	ПараметрыРегистрации.Информация 	 = НСтр("ru = '" + Информация + "'");
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти


#Область Обработчики

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)  
	
	ПараметрЗаголовок = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
	
	ДатаНачала 	  = Формат(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(0).Значение.ДатаНачала, "ДЛФ=D");
	ДатаОкончания = Формат(КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Получить(0).Значение.ДатаОкончания, "ДЛФ=D");
	
	Заголовок = "Выпуск продукции по оборудованию под заказ за %1 - %2";
	
	КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", СтрШаблон(Заголовок, ДатаНачала, ДатаОкончания));
	КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли